MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA308/mcu.h
extern volatile LCDDATA29BITS LCDDATA29bits __attribute__((__sfr__));

#define LCDDATA30 LCDDATA30
extern volatile uint16_t LCDDATA30 __attribute__((__sfr__));
typedef struct tagLCDDATA30BITS {
  uint16_t S32C7:1;
  uint16_t S33C7:1;
  uint16_t S34C7:1;
  uint16_t S35C7:1;
  uint16_t S36C7:1;
  uint16_t S37C7:1;
  uint16_t S38C7:1;
  uint16_t S39C7:1;
  uint16_t S40C7:1;
  uint16_t S41C7:1;
  uint16_t S42C7:1;
  uint16_t S43C7:1;
  uint16_t S44C7:1;
  uint16_t S45C7:1;
  uint16_t S46C7:1;
  uint16_t S47C7:1;
} LCDDATA30BITS;
extern volatile LCDDATA30BITS LCDDATA30bits __attribute__((__sfr__));

#define LCDDATA31 LCDDATA31
extern volatile uint16_t LCDDATA31 __attribute__((__sfr__));
typedef struct tagLCDDATA31BITS {
  uint16_t S48C7:1;
  uint16_t :1;
  uint16_t S50C7:1;
} LCDDATA31BITS;
extern volatile LCDDATA31BITS LCDDATA31bits __attribute__((__sfr__));

#define PMCON1 PMCON1
extern volatile uint16_t PMCON1 __attribute__((__sfr__));
__extension__ typedef struct tagPMCON1BITS {
  union {
    struct {
      uint16_t IRQM:2;
      uint16_t BUSKEEP:1;
      uint16_t :1;
      uint16_t ALMODE:1;
      uint16_t ALP:1;
      uint16_t CSF:2;
      uint16_t MODE:2;
      uint16_t :1;
      uint16_t ADRMUX:2;
      uint16_t PSIDL:1;
      uint16_t :1;
      uint16_t PMPEN:1;
    };
    struct {
      uint16_t IRQM0:1;
      uint16_t IRQM1:1;
      uint16_t :4;
      uint16_t CSF0:1;
      uint16_t CSF1:1;
      uint16_t MODE0:1;
      uint16_t MODE1:1;
      uint16_t :1;
      uint16_t ADRMUX0:1;
      uint16_t ADRMUX1:1;
    };
  };
} PMCON1BITS;
extern volatile PMCON1BITS PMCON1bits __attribute__((__sfr__));

#define PMCON2 PMCON2
extern volatile uint16_t PMCON2 __attribute__((__sfr__));
__extension__ typedef struct tagPMCON2BITS {
  union {
    struct {
      uint16_t RADDR:8;
      uint16_t :4;
      uint16_t TIMEOUT:1;
      uint16_t ERROR:1;
      uint16_t :1;
      uint16_t BUSY:1;
    };
    struct {
      uint16_t RADDR16:1;
      uint16_t RADDR17:1;
      uint16_t RADDR18:1;
      uint16_t RADDR19:1;
      uint16_t RADDR20:1;
      uint16_t RADDR21:1;
      uint16_t RADDR22:1;
      uint16_t RADDR23:1;
    };
  };
} PMCON2BITS;
extern volatile PMCON2BITS PMCON2bits __attribute__((__sfr__));

#define PMCON3 PMCON3
extern volatile uint16_t PMCON3 __attribute__((__sfr__));
__extension__ typedef struct tagPMCON3BITS {
  union {
    struct {
      uint16_t PTEN16:1;
      uint16_t PTEN17:1;
      uint16_t PTEN18:1;
      uint16_t PTEN19:1;
      uint16_t PTEN20:1;
      uint16_t PTEN21:1;
      uint16_t PTEN22:1;
      uint16_t :1;
      uint16_t AWAITE:1;
      uint16_t AWAITM:2;
      uint16_t :1;
      uint16_t PTBE0EN:1;
      uint16_t PTBE1EN:1;
      uint16_t PTRDEN:1;
      uint16_t PTWREN:1;
    };
    struct {
      uint16_t :9;
      uint16_t AWAITM0:1;
      uint16_t AWAITM1:1;
    };
  };
} PMCON3BITS;
extern volatile PMCON3BITS PMCON3bits __attribute__((__sfr__));

#define PMCON4 PMCON4
extern volatile uint16_t PMCON4 __attribute__((__sfr__));
typedef struct tagPMCON4BITS {
  uint16_t PTEN0:1;
  uint16_t PTEN1:1;
  uint16_t PTEN2:1;
  uint16_t PTEN3:1;
  uint16_t PTEN4:1;
  uint16_t PTEN5:1;
  uint16_t PTEN6:1;
  uint16_t PTEN7:1;
  uint16_t PTEN8:1;
  uint16_t PTEN9:1;
  uint16_t PTEN10:1;
  uint16_t PTEN11:1;
  uint16_t PTEN12:1;
  uint16_t PTEN13:1;
  uint16_t PTEN14:1;
  uint16_t PTEN15:1;
} PMCON4BITS;
extern volatile PMCON4BITS PMCON4bits __attribute__((__sfr__));

#define PMCS1CF PMCS1CF
extern volatile uint16_t PMCS1CF __attribute__((__sfr__));
__extension__ typedef struct tagPMCS1CFBITS {
  union {
    struct {
      uint16_t :5;
      uint16_t PTSZ:2;
      uint16_t ACKP:1;
      uint16_t SM:1;
      uint16_t RDSP:1;
      uint16_t WRSP:1;
      uint16_t :1;
      uint16_t BEP:1;
      uint16_t CSPTEN:1;
      uint16_t CSP:1;
      uint16_t CSDIS:1;
    };
    struct {
      uint16_t :5;
      uint16_t PTSZ0:1;
      uint16_t PTSZ1:1;
    };
  };
} PMCS1CFBITS;
extern volatile PMCS1CFBITS PMCS1CFbits __attribute__((__sfr__));

#define PMCS1BS PMCS1BS
extern volatile uint16_t PMCS1BS __attribute__((__sfr__));
typedef struct tagPMCS1BSBITS {
  uint16_t :3;
  uint16_t BASE11:1;
  uint16_t :3;
  uint16_t BASE15:1;
  uint16_t BASE16:1;
  uint16_t BASE17:1;
  uint16_t BASE18:1;
  uint16_t BASE19:1;
  uint16_t BASE20:1;
  uint16_t BASE21:1;
  uint16_t BASE22:1;
  uint16_t BASE23:1;
} PMCS1BSBITS;
extern volatile PMCS1BSBITS PMCS1BSbits __attribute__((__sfr__));

#define PMCS1MD PMCS1MD
extern volatile uint16_t PMCS1MD __attribute__((__sfr__));
__extension__ typedef struct tagPMCS1MDBITS {
  union {
    struct {
      uint16_t DWAITE:2;
      uint16_t DWAITM:4;
      uint16_t DWAITB:2;
      uint16_t :3;
      uint16_t AMWAIT:3;
      uint16_t ACKM:2;
    };
    struct {
      uint16_t DWAITE0:1;
      uint16_t DWAITE1:1;
      uint16_t DWAITM0:1;
      uint16_t DWAITM1:1;
      uint16_t DWAITM2:1;
      uint16_t DWAITM3:1;
      uint16_t DWAITB0:1;
      uint16_t DWAITB1:1;
      uint16_t :3;
      uint16_t AMWAIT0:1;
      uint16_t AMWAIT1:1;
      uint16_t AMWAIT2:1;
      uint16_t ACKM0:1;
      uint16_t ACKM1:1;
    };
  };
} PMCS1MDBITS;
extern volatile PMCS1MDBITS PMCS1MDbits __attribute__((__sfr__));

#define PMCS2CF PMCS2CF
extern volatile uint16_t PMCS2CF __attribute__((__sfr__));
__extension__ typedef struct tagPMCS2CFBITS {
  union {
    struct {
      uint16_t :5;
      uint16_t PTSZ:2;
      uint16_t ACKP:1;
      uint16_t SM:1;
      uint16_t RDSP:1;
      uint16_t WRSP:1;
      uint16_t :1;
      uint16_t BEP:1;
      uint16_t CSPTEN:1;
      uint16_t CSP:1;
      uint16_t CSDIS:1;
    };
    struct {
      uint16_t :5;
      uint16_t PTSZ0:1;
      uint16_t PTSZ1:1;
    };
  };
} PMCS2CFBITS;
extern volatile PMCS2CFBITS PMCS2CFbits __attribute__((__sfr__));

#define PMCS2BS PMCS2BS
extern volatile uint16_t PMCS2BS __attribute__((__sfr__));
typedef struct tagPMCS2BSBITS {
  uint16_t :3;
  uint16_t BASE11:1;
  uint16_t :3;
  uint16_t BASE15:1;
  uint16_t BASE16:1;
  uint16_t BASE17:1;
  uint16_t BASE18:1;
  uint16_t BASE19:1;
  uint16_t BASE20:1;
  uint16_t BASE21:1;
  uint16_t BASE22:1;
  uint16_t BASE23:1;
} PMCS2BSBITS;
extern volatile PMCS2BSBITS PMCS2BSbits __attribute__((__sfr__));

