MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA308/mcu.h
#define _DMACH5_DAMODE_POSITION                  0x00000004
#define _DMACH5_DAMODE_MASK                      0x00000030
#define _DMACH5_DAMODE_LENGTH                    0x00000002

#define _DMACH5_SAMODE_POSITION                  0x00000006
#define _DMACH5_SAMODE_MASK                      0x000000C0
#define _DMACH5_SAMODE_LENGTH                    0x00000002

#define _DMACH5_CHREQ_POSITION                   0x00000008
#define _DMACH5_CHREQ_MASK                       0x00000100
#define _DMACH5_CHREQ_LENGTH                     0x00000001

#define _DMACH5_RELOAD_POSITION                  0x00000009
#define _DMACH5_RELOAD_MASK                      0x00000200
#define _DMACH5_RELOAD_LENGTH                    0x00000001

#define _DMACH5_NULLW_POSITION                   0x0000000A
#define _DMACH5_NULLW_MASK                       0x00000400
#define _DMACH5_NULLW_LENGTH                     0x00000001

#define _DMACH5_TRMODE0_POSITION                 0x00000002
#define _DMACH5_TRMODE0_MASK                     0x00000004
#define _DMACH5_TRMODE0_LENGTH                   0x00000001

#define _DMACH5_TRMODE1_POSITION                 0x00000003
#define _DMACH5_TRMODE1_MASK                     0x00000008
#define _DMACH5_TRMODE1_LENGTH                   0x00000001

#define _DMACH5_DAMODE0_POSITION                 0x00000004
#define _DMACH5_DAMODE0_MASK                     0x00000010
#define _DMACH5_DAMODE0_LENGTH                   0x00000001

#define _DMACH5_DAMODE1_POSITION                 0x00000005
#define _DMACH5_DAMODE1_MASK                     0x00000020
#define _DMACH5_DAMODE1_LENGTH                   0x00000001

#define _DMACH5_SAMODE0_POSITION                 0x00000006
#define _DMACH5_SAMODE0_MASK                     0x00000040
#define _DMACH5_SAMODE0_LENGTH                   0x00000001

#define _DMACH5_SAMODE1_POSITION                 0x00000007
#define _DMACH5_SAMODE1_MASK                     0x00000080
#define _DMACH5_SAMODE1_LENGTH                   0x00000001

#define _DMAINT5_HALFEN_POSITION                 0x00000000
#define _DMAINT5_HALFEN_MASK                     0x00000001
#define _DMAINT5_HALFEN_LENGTH                   0x00000001

#define _DMAINT5_OVRUNIF_POSITION                0x00000003
#define _DMAINT5_OVRUNIF_MASK                    0x00000008
#define _DMAINT5_OVRUNIF_LENGTH                  0x00000001

#define _DMAINT5_HALFIF_POSITION                 0x00000004
#define _DMAINT5_HALFIF_MASK                     0x00000010
#define _DMAINT5_HALFIF_LENGTH                   0x00000001

#define _DMAINT5_DONEIF_POSITION                 0x00000005
#define _DMAINT5_DONEIF_MASK                     0x00000020
#define _DMAINT5_DONEIF_LENGTH                   0x00000001

#define _DMAINT5_LOWIF_POSITION                  0x00000006
#define _DMAINT5_LOWIF_MASK                      0x00000040
#define _DMAINT5_LOWIF_LENGTH                    0x00000001

#define _DMAINT5_HIGHIF_POSITION                 0x00000007
#define _DMAINT5_HIGHIF_MASK                     0x00000080
#define _DMAINT5_HIGHIF_LENGTH                   0x00000001

#define _DMAINT5_CHSEL_POSITION                  0x00000008
#define _DMAINT5_CHSEL_MASK                      0x00003F00
#define _DMAINT5_CHSEL_LENGTH                    0x00000006

#define _DMAINT5_DBUFWF_POSITION                 0x0000000F
#define _DMAINT5_DBUFWF_MASK                     0x00008000
#define _DMAINT5_DBUFWF_LENGTH                   0x00000001

#define _DMAINT5_CHSEL0_POSITION                 0x00000008
#define _DMAINT5_CHSEL0_MASK                     0x00000100
#define _DMAINT5_CHSEL0_LENGTH                   0x00000001

#define _DMAINT5_CHSEL1_POSITION                 0x00000009
#define _DMAINT5_CHSEL1_MASK                     0x00000200
#define _DMAINT5_CHSEL1_LENGTH                   0x00000001

#define _DMAINT5_CHSEL2_POSITION                 0x0000000A
#define _DMAINT5_CHSEL2_MASK                     0x00000400
#define _DMAINT5_CHSEL2_LENGTH                   0x00000001

#define _DMAINT5_CHSEL3_POSITION                 0x0000000B
#define _DMAINT5_CHSEL3_MASK                     0x00000800
#define _DMAINT5_CHSEL3_LENGTH                   0x00000001

#define _DMAINT5_CHSEL4_POSITION                 0x0000000C
#define _DMAINT5_CHSEL4_MASK                     0x00001000
#define _DMAINT5_CHSEL4_LENGTH                   0x00000001

#define _DMAINT5_CHSEL5_POSITION                 0x0000000D
#define _DMAINT5_CHSEL5_MASK                     0x00002000
#define _DMAINT5_CHSEL5_LENGTH                   0x00000001

#define _ANCFG_VBGEN_POSITION                    0x00000000
#define _ANCFG_VBGEN_MASK                        0x00000001
#define _ANCFG_VBGEN_LENGTH                      0x00000001

#define _ANCFG_VBG2EN_POSITION                   0x00000001
#define _ANCFG_VBG2EN_MASK                       0x00000002
#define _ANCFG_VBG2EN_LENGTH                     0x00000001

#define _ANCFG_VBG6EN_POSITION                   0x00000002
#define _ANCFG_VBG6EN_MASK                       0x00000004
#define _ANCFG_VBG6EN_LENGTH                     0x00000001

#define _ANSA_ANSA9_POSITION                     0x00000009
#define _ANSA_ANSA9_MASK                         0x00000200
#define _ANSA_ANSA9_LENGTH                       0x00000001

#define _ANSA_ANSA10_POSITION                    0x0000000A
#define _ANSA_ANSA10_MASK                        0x00000400
#define _ANSA_ANSA10_LENGTH                      0x00000001

#define _ANSA_ANSELA9_POSITION                   0x00000009
#define _ANSA_ANSELA9_MASK                       0x00000200
#define _ANSA_ANSELA9_LENGTH                     0x00000001

#define _ANSA_ANSELA10_POSITION                  0x0000000A
#define _ANSA_ANSELA10_MASK                      0x00000400
#define _ANSA_ANSELA10_LENGTH                    0x00000001

#define _ANSELA_ANSA9_POSITION                   0x00000009
#define _ANSELA_ANSA9_MASK                       0x00000200
#define _ANSELA_ANSA9_LENGTH                     0x00000001

#define _ANSELA_ANSA10_POSITION                  0x0000000A
#define _ANSELA_ANSA10_MASK                      0x00000400
#define _ANSELA_ANSA10_LENGTH                    0x00000001

#define _ANSELA_ANSELA9_POSITION                 0x00000009
#define _ANSELA_ANSELA9_MASK                     0x00000200
#define _ANSELA_ANSELA9_LENGTH                   0x00000001

#define _ANSELA_ANSELA10_POSITION                0x0000000A
#define _ANSELA_ANSELA10_MASK                    0x00000400
#define _ANSELA_ANSELA10_LENGTH                  0x00000001

#define _ANSB_ANSB0_POSITION                     0x00000000
#define _ANSB_ANSB0_MASK                         0x00000001
#define _ANSB_ANSB0_LENGTH                       0x00000001

#define _ANSB_ANSB1_POSITION                     0x00000001
#define _ANSB_ANSB1_MASK                         0x00000002
#define _ANSB_ANSB1_LENGTH                       0x00000001

#define _ANSB_ANSB2_POSITION                     0x00000002
#define _ANSB_ANSB2_MASK                         0x00000004
#define _ANSB_ANSB2_LENGTH                       0x00000001

#define _ANSB_ANSB3_POSITION                     0x00000003
#define _ANSB_ANSB3_MASK                         0x00000008
#define _ANSB_ANSB3_LENGTH                       0x00000001

#define _ANSB_ANSB4_POSITION                     0x00000004
#define _ANSB_ANSB4_MASK                         0x00000010
#define _ANSB_ANSB4_LENGTH                       0x00000001

#define _ANSB_ANSB5_POSITION                     0x00000005
#define _ANSB_ANSB5_MASK                         0x00000020
#define _ANSB_ANSB5_LENGTH                       0x00000001

#define _ANSB_ANSB6_POSITION                     0x00000006
#define _ANSB_ANSB6_MASK                         0x00000040
#define _ANSB_ANSB6_LENGTH                       0x00000001

#define _ANSB_ANSB7_POSITION                     0x00000007
#define _ANSB_ANSB7_MASK                         0x00000080
#define _ANSB_ANSB7_LENGTH                       0x00000001

#define _ANSB_ANSB8_POSITION                     0x00000008
#define _ANSB_ANSB8_MASK                         0x00000100
#define _ANSB_ANSB8_LENGTH                       0x00000001

