MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA308/mcu.h
#define _ANSELB_ANSB11_POSITION                  0x0000000B
#define _ANSELB_ANSB11_MASK                      0x00000800
#define _ANSELB_ANSB11_LENGTH                    0x00000001

#define _ANSELB_ANSB12_POSITION                  0x0000000C
#define _ANSELB_ANSB12_MASK                      0x00001000
#define _ANSELB_ANSB12_LENGTH                    0x00000001

#define _ANSELB_ANSB13_POSITION                  0x0000000D
#define _ANSELB_ANSB13_MASK                      0x00002000
#define _ANSELB_ANSB13_LENGTH                    0x00000001

#define _ANSELB_ANSB14_POSITION                  0x0000000E
#define _ANSELB_ANSB14_MASK                      0x00004000
#define _ANSELB_ANSB14_LENGTH                    0x00000001

#define _ANSELB_ANSB15_POSITION                  0x0000000F
#define _ANSELB_ANSB15_MASK                      0x00008000
#define _ANSELB_ANSB15_LENGTH                    0x00000001

#define _ANSELB_ANSELB0_POSITION                 0x00000000
#define _ANSELB_ANSELB0_MASK                     0x00000001
#define _ANSELB_ANSELB0_LENGTH                   0x00000001

#define _ANSELB_ANSELB1_POSITION                 0x00000001
#define _ANSELB_ANSELB1_MASK                     0x00000002
#define _ANSELB_ANSELB1_LENGTH                   0x00000001

#define _ANSELB_ANSELB2_POSITION                 0x00000002
#define _ANSELB_ANSELB2_MASK                     0x00000004
#define _ANSELB_ANSELB2_LENGTH                   0x00000001

#define _ANSELB_ANSELB3_POSITION                 0x00000003
#define _ANSELB_ANSELB3_MASK                     0x00000008
#define _ANSELB_ANSELB3_LENGTH                   0x00000001

#define _ANSELB_ANSELB4_POSITION                 0x00000004
#define _ANSELB_ANSELB4_MASK                     0x00000010
#define _ANSELB_ANSELB4_LENGTH                   0x00000001

#define _ANSELB_ANSELB5_POSITION                 0x00000005
#define _ANSELB_ANSELB5_MASK                     0x00000020
#define _ANSELB_ANSELB5_LENGTH                   0x00000001

#define _ANSELB_ANSELB6_POSITION                 0x00000006
#define _ANSELB_ANSELB6_MASK                     0x00000040
#define _ANSELB_ANSELB6_LENGTH                   0x00000001

#define _ANSELB_ANSELB7_POSITION                 0x00000007
#define _ANSELB_ANSELB7_MASK                     0x00000080
#define _ANSELB_ANSELB7_LENGTH                   0x00000001

#define _ANSELB_ANSELB8_POSITION                 0x00000008
#define _ANSELB_ANSELB8_MASK                     0x00000100
#define _ANSELB_ANSELB8_LENGTH                   0x00000001

#define _ANSELB_ANSELB9_POSITION                 0x00000009
#define _ANSELB_ANSELB9_MASK                     0x00000200
#define _ANSELB_ANSELB9_LENGTH                   0x00000001

#define _ANSELB_ANSELB10_POSITION                0x0000000A
#define _ANSELB_ANSELB10_MASK                    0x00000400
#define _ANSELB_ANSELB10_LENGTH                  0x00000001

#define _ANSELB_ANSELB11_POSITION                0x0000000B
#define _ANSELB_ANSELB11_MASK                    0x00000800
#define _ANSELB_ANSELB11_LENGTH                  0x00000001

#define _ANSELB_ANSELB12_POSITION                0x0000000C
#define _ANSELB_ANSELB12_MASK                    0x00001000
#define _ANSELB_ANSELB12_LENGTH                  0x00000001

#define _ANSELB_ANSELB13_POSITION                0x0000000D
#define _ANSELB_ANSELB13_MASK                    0x00002000
#define _ANSELB_ANSELB13_LENGTH                  0x00000001

#define _ANSELB_ANSELB14_POSITION                0x0000000E
#define _ANSELB_ANSELB14_MASK                    0x00004000
#define _ANSELB_ANSELB14_LENGTH                  0x00000001

#define _ANSELB_ANSELB15_POSITION                0x0000000F
#define _ANSELB_ANSELB15_MASK                    0x00008000
#define _ANSELB_ANSELB15_LENGTH                  0x00000001

#define _ANSD_ANSD6_POSITION                     0x00000006
#define _ANSD_ANSD6_MASK                         0x00000040
#define _ANSD_ANSD6_LENGTH                       0x00000001

#define _ANSD_ANSD7_POSITION                     0x00000007
#define _ANSD_ANSD7_MASK                         0x00000080
#define _ANSD_ANSD7_LENGTH                       0x00000001

#define _ANSD_ANSD10_POSITION                    0x0000000A
#define _ANSD_ANSD10_MASK                        0x00000400
#define _ANSD_ANSD10_LENGTH                      0x00000001

#define _ANSD_ANSD11_POSITION                    0x0000000B
#define _ANSD_ANSD11_MASK                        0x00000800
#define _ANSD_ANSD11_LENGTH                      0x00000001

#define _ANSD_ANSELD6_POSITION                   0x00000006
#define _ANSD_ANSELD6_MASK                       0x00000040
#define _ANSD_ANSELD6_LENGTH                     0x00000001

#define _ANSD_ANSELD7_POSITION                   0x00000007
#define _ANSD_ANSELD7_MASK                       0x00000080
#define _ANSD_ANSELD7_LENGTH                     0x00000001

#define _ANSD_ANSELD10_POSITION                  0x0000000A
#define _ANSD_ANSELD10_MASK                      0x00000400
#define _ANSD_ANSELD10_LENGTH                    0x00000001

#define _ANSD_ANSELD11_POSITION                  0x0000000B
#define _ANSD_ANSELD11_MASK                      0x00000800
#define _ANSD_ANSELD11_LENGTH                    0x00000001

#define _ANSELD_ANSD6_POSITION                   0x00000006
#define _ANSELD_ANSD6_MASK                       0x00000040
#define _ANSELD_ANSD6_LENGTH                     0x00000001

#define _ANSELD_ANSD7_POSITION                   0x00000007
#define _ANSELD_ANSD7_MASK                       0x00000080
#define _ANSELD_ANSD7_LENGTH                     0x00000001

#define _ANSELD_ANSD10_POSITION                  0x0000000A
#define _ANSELD_ANSD10_MASK                      0x00000400
#define _ANSELD_ANSD10_LENGTH                    0x00000001

#define _ANSELD_ANSD11_POSITION                  0x0000000B
#define _ANSELD_ANSD11_MASK                      0x00000800
#define _ANSELD_ANSD11_LENGTH                    0x00000001

#define _ANSELD_ANSELD6_POSITION                 0x00000006
#define _ANSELD_ANSELD6_MASK                     0x00000040
#define _ANSELD_ANSELD6_LENGTH                   0x00000001

#define _ANSELD_ANSELD7_POSITION                 0x00000007
#define _ANSELD_ANSELD7_MASK                     0x00000080
#define _ANSELD_ANSELD7_LENGTH                   0x00000001

#define _ANSELD_ANSELD10_POSITION                0x0000000A
#define _ANSELD_ANSELD10_MASK                    0x00000400
#define _ANSELD_ANSELD10_LENGTH                  0x00000001

#define _ANSELD_ANSELD11_POSITION                0x0000000B
#define _ANSELD_ANSELD11_MASK                    0x00000800
#define _ANSELD_ANSELD11_LENGTH                  0x00000001

