MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA308/mcu.h
#define _LCDDATA5_S30C1_POSITION                 0x0000000E
#define _LCDDATA5_S30C1_MASK                     0x00004000
#define _LCDDATA5_S30C1_LENGTH                   0x00000001

#define _LCDDATA5_S31C1_POSITION                 0x0000000F
#define _LCDDATA5_S31C1_MASK                     0x00008000
#define _LCDDATA5_S31C1_LENGTH                   0x00000001

#define _LCDDATA6_S32C1_POSITION                 0x00000000
#define _LCDDATA6_S32C1_MASK                     0x00000001
#define _LCDDATA6_S32C1_LENGTH                   0x00000001

#define _LCDDATA6_S33C1_POSITION                 0x00000001
#define _LCDDATA6_S33C1_MASK                     0x00000002
#define _LCDDATA6_S33C1_LENGTH                   0x00000001

#define _LCDDATA6_S34C1_POSITION                 0x00000002
#define _LCDDATA6_S34C1_MASK                     0x00000004
#define _LCDDATA6_S34C1_LENGTH                   0x00000001

#define _LCDDATA6_S35C1_POSITION                 0x00000003
#define _LCDDATA6_S35C1_MASK                     0x00000008
#define _LCDDATA6_S35C1_LENGTH                   0x00000001

#define _LCDDATA6_S36C1_POSITION                 0x00000004
#define _LCDDATA6_S36C1_MASK                     0x00000010
#define _LCDDATA6_S36C1_LENGTH                   0x00000001

#define _LCDDATA6_S37C1_POSITION                 0x00000005
#define _LCDDATA6_S37C1_MASK                     0x00000020
#define _LCDDATA6_S37C1_LENGTH                   0x00000001

#define _LCDDATA6_S38C1_POSITION                 0x00000006
#define _LCDDATA6_S38C1_MASK                     0x00000040
#define _LCDDATA6_S38C1_LENGTH                   0x00000001

#define _LCDDATA6_S39C1_POSITION                 0x00000007
#define _LCDDATA6_S39C1_MASK                     0x00000080
#define _LCDDATA6_S39C1_LENGTH                   0x00000001

#define _LCDDATA6_S40C1_POSITION                 0x00000008
#define _LCDDATA6_S40C1_MASK                     0x00000100
#define _LCDDATA6_S40C1_LENGTH                   0x00000001

#define _LCDDATA6_S41C1_POSITION                 0x00000009
#define _LCDDATA6_S41C1_MASK                     0x00000200
#define _LCDDATA6_S41C1_LENGTH                   0x00000001

#define _LCDDATA6_S42C1_POSITION                 0x0000000A
#define _LCDDATA6_S42C1_MASK                     0x00000400
#define _LCDDATA6_S42C1_LENGTH                   0x00000001

#define _LCDDATA6_S43C1_POSITION                 0x0000000B
#define _LCDDATA6_S43C1_MASK                     0x00000800
#define _LCDDATA6_S43C1_LENGTH                   0x00000001

#define _LCDDATA6_S44C1_POSITION                 0x0000000C
#define _LCDDATA6_S44C1_MASK                     0x00001000
#define _LCDDATA6_S44C1_LENGTH                   0x00000001

#define _LCDDATA6_S45C1_POSITION                 0x0000000D
#define _LCDDATA6_S45C1_MASK                     0x00002000
#define _LCDDATA6_S45C1_LENGTH                   0x00000001

#define _LCDDATA6_S46C1_POSITION                 0x0000000E
#define _LCDDATA6_S46C1_MASK                     0x00004000
#define _LCDDATA6_S46C1_LENGTH                   0x00000001

#define _LCDDATA6_S47C1_POSITION                 0x0000000F
#define _LCDDATA6_S47C1_MASK                     0x00008000
#define _LCDDATA6_S47C1_LENGTH                   0x00000001

#define _LCDDATA7_S48C1_POSITION                 0x00000000
#define _LCDDATA7_S48C1_MASK                     0x00000001
#define _LCDDATA7_S48C1_LENGTH                   0x00000001

#define _LCDDATA7_S50C1_POSITION                 0x00000002
#define _LCDDATA7_S50C1_MASK                     0x00000004
#define _LCDDATA7_S50C1_LENGTH                   0x00000001

#define _LCDDATA8_S00C2_POSITION                 0x00000000
#define _LCDDATA8_S00C2_MASK                     0x00000001
#define _LCDDATA8_S00C2_LENGTH                   0x00000001

#define _LCDDATA8_S01C2_POSITION                 0x00000001
#define _LCDDATA8_S01C2_MASK                     0x00000002
#define _LCDDATA8_S01C2_LENGTH                   0x00000001

#define _LCDDATA8_S02C2_POSITION                 0x00000002
#define _LCDDATA8_S02C2_MASK                     0x00000004
#define _LCDDATA8_S02C2_LENGTH                   0x00000001

#define _LCDDATA8_S03C2_POSITION                 0x00000003
#define _LCDDATA8_S03C2_MASK                     0x00000008
#define _LCDDATA8_S03C2_LENGTH                   0x00000001

#define _LCDDATA8_S04C2_POSITION                 0x00000004
#define _LCDDATA8_S04C2_MASK                     0x00000010
#define _LCDDATA8_S04C2_LENGTH                   0x00000001

#define _LCDDATA8_S05C2_POSITION                 0x00000005
#define _LCDDATA8_S05C2_MASK                     0x00000020
#define _LCDDATA8_S05C2_LENGTH                   0x00000001

#define _LCDDATA8_S06C2_POSITION                 0x00000006
#define _LCDDATA8_S06C2_MASK                     0x00000040
#define _LCDDATA8_S06C2_LENGTH                   0x00000001

#define _LCDDATA8_S07C2_POSITION                 0x00000007
#define _LCDDATA8_S07C2_MASK                     0x00000080
#define _LCDDATA8_S07C2_LENGTH                   0x00000001

#define _LCDDATA8_S08C2_POSITION                 0x00000008
#define _LCDDATA8_S08C2_MASK                     0x00000100
#define _LCDDATA8_S08C2_LENGTH                   0x00000001

#define _LCDDATA8_S09C2_POSITION                 0x00000009
#define _LCDDATA8_S09C2_MASK                     0x00000200
#define _LCDDATA8_S09C2_LENGTH                   0x00000001

#define _LCDDATA8_S10C2_POSITION                 0x0000000A
#define _LCDDATA8_S10C2_MASK                     0x00000400
#define _LCDDATA8_S10C2_LENGTH                   0x00000001

#define _LCDDATA8_S11C2_POSITION                 0x0000000B
#define _LCDDATA8_S11C2_MASK                     0x00000800
#define _LCDDATA8_S11C2_LENGTH                   0x00000001

#define _LCDDATA8_S12C2_POSITION                 0x0000000C
#define _LCDDATA8_S12C2_MASK                     0x00001000
#define _LCDDATA8_S12C2_LENGTH                   0x00000001

#define _LCDDATA8_S13C2_POSITION                 0x0000000D
#define _LCDDATA8_S13C2_MASK                     0x00002000
#define _LCDDATA8_S13C2_LENGTH                   0x00000001

#define _LCDDATA8_S14C2_POSITION                 0x0000000E
#define _LCDDATA8_S14C2_MASK                     0x00004000
#define _LCDDATA8_S14C2_LENGTH                   0x00000001

